---
kind: type
id: T:Autodesk.Revit.DB.CurveElementFilter
source: html/d31574f5-4400-c4f9-04dd-4418c302e3c5.htm
---
# Autodesk.Revit.DB.CurveElementFilter

A filter used to pass curve elements which are of a specific type.

## Syntax (C#)
```csharp
public class CurveElementFilter : ElementSlowFilter
```